Список Модификаторов:

- Random Modifier (+10%)
- 3 Random Modifiers (+30%)
- 5 Random Modifiers (+50%)

- Ghost Tapping (-10%)
- Low Speed (-10%)
- Lowest Speed (-30%)
- No Death (-20%)
- 100% Health Start (-20%)
- More Coin Notes (-30%)
- No Mechanics (-50%)
- 3K+Random (-5%)
- 2K+Random (-10%)
- 1K+Random (-20%)

- High Speed (+10%)
- HIGHER Speed (+20%)
- MAXIMUM SPEED (+50%)
- Low Health Drain (+5%)
- High Health Drain (+15%)
- Low HP: Increase Speed (+5%)
- Slow Health Gain (+5%)
- Fast Health Loss (+10%)
- Only "Epic" (+30%)
- 5% Heath Start (+20%)
- 50% MAX Health (+10%)
- Flip Notes (+10%)
- Random Notes (+20%)
- .jpeg Fun (+50%)
- Half Note Appear (+15%)
- Half Note Disappear (+5%)
- Random Strums Speed (+20%)
- Mania Mode (+50%)
- Less Coin Notes (+5%)
- No Coin Notes (+10%)
- More Mechanics (+20%)


- 5K+Random (+20%)
- 6K+Random (+50%)
- 7K+Random (+70%)
- 8K+Random (+100%)
- 9K+Random (+120%)

- Practice Mode (NO SCORES/NO SAVE)
- Botplay (NO MODIFIERS/NO SCORES/NO SAVE)

(Порядок модификаторов, которые будут разложены здесь, будут также разложены и в игре.)


Имя: Маленькая Справедливость
Описание: Активирует случайный модификатор любого типа, даже если некоторые модификаторы у вас заблокированы.
Цвет: 0xf8e74e

Бонус: +10%
Способ получения: [Изначально доступен]

Имя: Случайная Злоба
Описание: Активирует 3 случайных модификатора любого типа, даже если некоторые модификаторы у вас заблокированы.
Цвет: 0xec9b31

Бонус: +30%
Способ получения: [Изначально доступен]

Имя: Коварные Проблемы
Описание: Активирует 5 случайных модификатора любого типа, даже если некоторые модификаторы у вас заблокированы.
Цвет: 0xf37725

Бонус: +50%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Фантомная Выручка
Описание: Если вы нажмете на пустые ноты, игра не засчитает ошибку ("Промахи"). Похоже, что вы так увлечены этим отстойным дерьмом? Брух...
Цвет: 0x3eb61a

Бонус: -10%
Способ получения: [Изначально доступен]

Имя: Медлительное Счастье
Описание: Скорость движения нот будет ниже. Возможно, ваше сознание не способно реагировать с достаточно нормальной скоростью.....
Цвет: 0x61d12d

Бонус: -10%
Способ получения: [Изначально доступен]

Имя: Отсталый Умник
Описание: Скорость нот станет еще медленнее... Неужели ваши реакции настолько заторможены?
Цвет: 0x1ebb4d

Бонус: -30%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Ловкий Улов
Описание: Скорость нот будет идти немного быстрее, чем обычно. Неужели ваш ум настолько смел, что вы можете реагировать на ЭТО!?
Цвет: 0xddcc34

Бонус: +10%
Способ получения: Разблокировать достижение: [Изначально доступен]

Имя: Быстрее Чем Пуля
Описание: Скорость нот будет идти НАМНОГО быстрее, чем обычно! ВЫ ПЕРЕИГРАЛИ В GEOMETRY DASH, ПРОХОДЯ ЭКСТРИМ ДЕМОНЫ!?
Цвет: 0xbb5d1e

Бонус: +20%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: БЫСТРЕЕ РАЗУМА
Описание: ВАШИ НОТЫ ПРЕВРАТЯТСЯ В ГРЕБАНОГО СОНИКА!!
Цвет: 0x1e7cbb

Бонус: +50%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Бессмертное Желание
Описание: Вы не умрете, так как главный бог решил наградить вас бессмертием... Бесчестным бессмертием.
Цвет: 0x29d671

Бонус: -20%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Здоровее чем когда-либо
Описание: Ваша шкала здоровья будет начинаться прямо со 100%. Ваш противник будет завидовать вам, что вам так повезло.
Цвет: 0x20b67c

Бонус: -20%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Едва Поспеваем
Описание: Ваша шкала здоровья начнется с отметки 5% Кажется, что вы пока находились в начале песни, Light от злости успел пырнуть вас ножом, но вы все еще стоите на ногах.
Цвет: 0xf7813d

Бонус: +15%
Способ получения: [Изначально доступен]

Имя: Наполовину Укушенный
Описание: Ваша шкала здоровья максимально сократится до 50%. Предел решил сыграть с вами злую шутку.
Цвет: 0xcc4b4b

Бонус: +10%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Музыкальный Казус
Описание: Чем меньше у вас здоровья, тем быстрее будут двигаться ноты.... УХОДИТЕ КЛОУНЫ!
Цвет: 0xf88b61

Бонус: +5%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Вредоносный Иммунитет
Описание: Ваша полоска здоровья будет очень медленно увеличиваться при ударах в такт ноты. Теперь ваше здоровье превратилось в гнилую улитку.
Цвет: 0xf0cc2c

Бонус: +5%
Способ получения: [Изначально доступен]

Имя: Непостижимая Справедливость
Описание: Во время хода противника ваше здоровье будет расходоваться медленнее, чем обычно. Если шкала здоровья достигает нуля, вы автоматически получаете "Blueballed". В обычном случае мотивация старичков из команды ColStorm также расходуется впустую.
Цвет: 0xee811a

Бонус: +5%
Способ получения: [Изначально доступен]

Имя: Недоброжелатель с Иммунитетом
Описание: Во время хода противника ваше здоровье будет расходоваться быстрее, чем обычно. Если полоска здоровья достигает нуля, вы автоматически получаете "Blueballed". Прямо как мотивация для рисования спрайтов от оранге.
Цвет: 0xff460e

Бонус: +15%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Проклятая Ошибка
Описание: Если вы допустите ошибку или промахнетесь, шкала здоровья будет теряться гораздо быстрее, чем обычно. Именно так новички FNF представляют себе свой истинный страх в спидране.
Цвет: 0xeb3a3a

Бонус: +10%
Способ получения: [Изначально доступен]

Имя: Эпический ПЕРФЕКЦИОНизм
Описание: Вам нужно набирать только "Epic" комбо. В противном случае вы сразу же заработаете "Blueballed". А теперь представьте, каково это - исправлять свои оценки в школе......
Цвет: 0xebae2b

Бонус: +30%
Способ получения: [Изначально доступен]

Имя: нЕпРаВиЛьНыЕ НоТы
Описание: Ноты в песне поменяются местами, что создаст неудобный пассаж. Хм... Надо попробовать провести эксперимент по замене "хлеба и масла" местами..... Звучит как-то нелепо...
Цвет: 0xda9e1f

Бонус: +10%
Способ получения: [Изначально доступен]

Имя: Мистерия Интеллекта
Описание: Ноты будут разбросаны в случайном порядке.... Теперь вопрос: Добрался ли искусственный интеллект до FNF Colors Adventure, или какие-то нехорошие дети устроили беспорядок?
Цвет: 0x4a10b4

Бонус: +20%
Способ получения: [Изначально доступен]

Имя: Призрачный Танец
Описание: Ноты появляются только на пол-экрана, поэтому вы можете не успеть среагировать... Шпионы будут в полной заднице...
Цвет: 0xb1ce11

Бонус: +15%
Способ получения: [Изначально доступен]

Имя: Ноты - Самозванцы
Описание: Ноты появляются только на пол-экрана, так что слепые белки могут оказаться довольно тупыми...
Цвет: 0xf1af21

Бонус: +5%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Избалованные Гипнотизеры
Описание: Ваши ноты будут мчаться с произвольной скоростью.... Хотя мы думаем, что частицы вируса все еще летают....
Цвет: 0xecd342

Бонус: +20%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Режим Мании
Описание: Этот модификатор меняет сложность на ТЯЖЕЛУЮ! Помните, какие песни были в osu!mania?
Цвет: 0xaf0c86

Бонус: +50%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Мастер Взломщик
Описание: Coin Note будут появляться больше чем обычно.
Цвет: 0x29b90d

Бонус: -30%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Монетный Ненавистник
Описание: Coin Note будут появляться меньше чем обычно.
Цвет: 0xd5b200

Бонус: +5%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Неистовый Обжора
Описание: Coin Note вообще не будут появляться.
Цвет: 0xf36e1e

Бонус: +10%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Малодушный Механик
Описание: Механики не будут появляться в песне, как и ваша трусливая задница.
Цвет: 0x20d36b

Бонус: -50%
Способ получения: [Изначально доступен]

Имя: В Поисках Удвоения
Описание: Механики будут появляться чаще, чем обычно.
Цвет: 0xa8cf18

Бонус: +20%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Отвратительное Потоковое Соединение
Описание: ЭЙ БРО! УВЕЛИЧЬ БЛЯТСКОЕ ОКНО И КУПИ БЛЯТЬ БАССИСТЫЕ НАУШНИКИ!
Цвет: 0x18c574

Бонус: +50%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Ботаник с Одной Кнопкой
Описание: Модификатор включает в себя режим 1K, а также встроенный Random Notes. Как долго можно нажимать только одну чертову кнопку!!!? А!?
Цвет: 0x1c62ef

Бонус: -20%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Два и Два
Описание: Модификатор включает в себя режим 2K, а также встроенный Random Notes.
Цвет: 0x2719f0

Бонус: -10%
Способ получения: Разблокировать достижение: "Experimental Feedback"

Имя: Тройной Цикл
Описание: Модификатор включает в себя режим 3K, а также встроенный Random Notes.
Цвет: 0x7b16f2

Бонус: -5%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Пятикратное Безумие
Описание: Модификатор включает в себя режим 5K, а также встроенный Random Notes. Um... A Triple Trouble moment, but instead of a ring of DAMN ROMB?
Цвет: 0xd312f3

Бонус: +20%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Шесть Вспышек
Описание: Модификатор включает в себя режим 6K, а также встроенный Random Notes. Готовы ли вы, по крайней мере, пройти через песню с 6 стрелками, если игроки ее ненавидят?
Цвет: 0xf50fba

Бонус: +50%
Способ получения: Разблокировать достижение: "Iridescent Overkill"

Имя: Семикратное Колесо Жесткости
Описание: Модификатор включает в себя режим 7K, а также встроенный Random Notes.
Цвет: 0xf60c5d

Бонус: +70%
Способ получения: Разблокировать достижение: "Infernal Deity"

Имя: Восьмикратная Агония Смерти
Описание: Модификатор включает в себя режим 8K, а также встроенный Random Notes.
Цвет: 0xf71408

Бонус: +100%
Способ получения: Разблокировать достижение: "Infernal Deity"

Имя: Фатальная Девятка
Описание: Модификатор включает в себя режим 9K, а также встроенный Random Notes. Что ж... Развлекайтесь, пока можете, мелкие просители прямиком в АД.....
Цвет: 0xf87206

Бонус: +150%
Способ получения: Разблокировать достижение: "Infernal Deity"

Имя: Режим Практики
Описание: Если вы хотите потренироваться, то режим Practice Mode для вас, но ваша статистика и очки не будут сохранены!
Цвет: 0xb1b1b1

Бонус: NO SCORES/NO SAVE
Способ получения: [Изначально доступен]

Имя: Ботплей
Описание: ... Нет смысла объяснять... Модификаторы не будут работать, а очки и статистика не будут сохранены.
Цвет: 0xb1b1b1

Бонус: NO MODIFIERS/NO SCORES/NO SAVE
Способ получения: [Изначально доступен]