Краткий Список Бейджиков (Включая V2 и V3)
- Первый вход в мод
- Первый вход в GameJolt
- Пройти "Prologue"
- Пройти "Red Chapter"
- Пройти "Orange Chapter"
- Пройти "Yellow Chapter"
- Пройти "Green Chapter"
- Пройти "Light Chapter"
- Пройти "Blue Chapter"
- Пройти "Purple Chapter"
- Пройти "Gray Chapter"
- Пройти "Epilogue"
- Пройти "Bad Ending"
- Пройти "Bad Ending" после "Good Ending" - ОТКАЗ
- Пройти "Good Ending" после "Bad Ending"
- Пройти "Prologue" на все ранг P
- Пройти "Red Chapter" на все ранг P
- Пройти "Orange Chapter" на все ранг P
- Пройти "Yellow Chapter" на все ранг P
- Пройти "Green Chapter" на все ранг P
- Пройти "Light Chapter" на все ранг P
- Пройти "Blue Chapter" на все ранг P
- Пройти "Purple Chapter" на все ранг P
- Пройти "Gray Chapter" на все ранг P
- Пройти "Epilogue" на все ранг P
- Пройти "Bad Ending" на все ранг P
- Пройти песню "Redness"
- Принять первую смерть
- Умереть 50 раз
- Получить первый ранг S
- Получить первый ранг P
- Найти все секретные записки
- Словить первый сюжетный глитч
- Пройти песню с набравшим бонусом 50%
- Пройти песню с набравшим бонусом 150%
- Пройти песню с набравшим бонусом 200%
- Поговорить с таинственным незнакомцем в мрачной, таинственной пустоте
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-

Краткий Список Бейджиков (Для DEMO v1.5)
- Первый вход в мод
- Первый вход в GameJolt
- Пройти "Prologue"
- Пройти "Red Chapter"
- Пройти "Orange Chapter"
- Пройти "Yellow Chapter"
- Пройти песню "Redness"
- Пройти "Prologue" на все ранг P
- Пройти "Red Chapter" на все ранг P
- Пройти "Orange Chapter" на все ранг P
- Пройти "Yellow Chapter" на все ранг P
- Принять первую смерть
- Умереть 50 раз
- Умереть 100 раз
- Получить первый ранг S
- Получить первый ранг P
- Найти все секретные записки
- Словить первый сюжетный глитч
- Пройти песню с набравшим бонусом 50%
- Пройти песню с набравшим бонусом 150%
- Пройти песню с набравшим бонусом 200%

DEMO V1.5:
Имя: Добро пожаловать!
Подзаголовок: ЭЙ! У нас гость! Встречайте!
Описание: Первый раз запустить Friday Night Funkin Colors Adventure

Имя: Зеленая закуска
Подзаголовок: Готовы ли вы делиться своими успехами с другими игроками? 
Описание: Первый раз войти в свой аккаунт в Gamejolt

Имя: Приключения начинаются
Подзаголовок:
Описание: Пройти "Prologue"

Имя: Однажды в парке
Подзаголовок:
Описание: Пройти "Red Chapter"

Имя: Первый раунд или первый страх
Подзаголовок:
Описание: Пройти "Orange Chapter"

Имя: Жизнь - боль
Подзаголовок:
Описание: Пройти "Yellow Chapter"

Имя:
Подзаголовок:
Описание: Пройти песню "Redness"

Имя:
Подзаголовок:
Описание: Пройти "Prologue" на все ранг P

Имя:
Подзаголовок:
Описание: Пройти "Red Chapter" на все ранг P

Имя:
Подзаголовок:
Описание: Пройти "Orange Chapter" на все ранг P

Имя:
Подзаголовок:
Описание: Пройти "Yellow Chapter" на все ранг P

Имя:
Подзаголовок:
Описание: Принять первую смерть

Имя:
Подзаголовок:
Описание: Умереть 50 раз

Имя:
Подзаголовок:
Описание: Умереть 100 раз

Имя:
Подзаголовок:
Описание: Получить первый ранг S

Имя:
Подзаголовок:
Описание: Получить первый ранг P

Имя:
Подзаголовок:
Описание: Найти все секретные записки

Имя:
Подзаголовок:
Описание: Словить первый сюжетный глитч

Имя: Обратная связь
Подзаголовок:
Описание: Пройти песню с набравшим бонусом 50%

Имя: Радужный перебор
Подзаголовок:
Описание: Пройти песню с набравшим бонусом 150%

Имя: Инфернальное божество
Подзаголовок:
Описание: Пройти песню с набравшим бонусом 200%


V2.0:
Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:

Имя:
Подзаголовок:
Описание:
